tianshu0/esp32-hub/sdkconfig.defaults
# esp32-hub 默认配置（目标芯片 ESP32-C3 / 4MB Flash / JD9853 240x296 SPI 屏）
# 固定目标芯片，避免换机器构建时误用 esp32 默认目标
CONFIG_IDF_TARGET="esp32c3"

# 增大主任务栈，容纳 C++/组件初始化（BLE + MQTT + LVGL）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# 自定义分区表（4MB 方案，见 partitions.csv）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash 大小：4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# LVGL：中继大屏需要 Montserrat 16/24（14 为默认字体）
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y

# BLE：使用 NimBLE 协议栈（占用更小）
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# 关闭外设模式，本设备只做 Central
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
# 最多同时连接 4 个 sensor node
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=4

# ESP32-C3 单核且 IRAM 有限，Wi-Fi 与 BLE 同时启用时容易溢出：
# 关闭 Wi-Fi 的 IRAM 优化，把收发路径代码放回 Flash，换取 IRAM 空间
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
